* TODO Shanbei English words learning :learning:
SCHEDULED: <2021-09-04 Sat 14:00 +1d>
:PROPERTIES:
:LAST_REPEAT: [2021-09-03 Fri 23:19]
:END:
- State "DONE"       from "TODO"       [2021-09-03 Fri 23:19]
- State "DONE"       from "TODO"       [2021-09-02 Thu 23:03]
- State "DONE"       from "TODO"       [2021-09-01 Wed 23:04]
- State "DONE"       from "TODO"       [2021-08-31 Tue 19:21]
- State "DONE"       from "TODO"       [2021-08-31 Tue 10:03]
- State "DONE"       from "STRT"       [2021-08-29 Sun 21:28]
- State "DONE"       from "TODO"       [2021-08-29 Sun 20:47]
- State "KILL"       from "TODO"       [2021-08-28 Sat 09:55]
- State "DONE"       from "STRT"       [2021-08-26 Thu 14:13]
- State "DONE"       from "TODO"       [2021-08-25 Wed 14:26]
- State "DONE"       from "TODO"       [2021-08-25 Wed 10:12]
- State "DONE"       from "STRT"       [2021-08-23 Mon 14:10]
- State "DONE"       from "TODO"       [2021-08-23 Mon 10:52]
- State "KILL"       from "TODO"       [2021-08-23 Mon 10:51]
- State "DONE"       from "TODO"       [2021-08-21 Sat 09:53]
- State "KILL"       from "TODO"       [2021-08-20 Fri 10:06]
- State "DONE"       from "TODO"       [2021-08-18 Wed 17:35]
- State "DONE"       from "TODO"       [2021-08-17 Tue 23:43]
- State "DONE"       from "STRT"       [2021-08-16 Mon 14:15]
- State "DONE"       from "TODO"       [2021-08-15 Sun 23:31]
- State "DONE"       from "TODO"       [2021-08-15 Sun 12:16]
- State "DONE"       from "TODO"       [2021-08-12 Thu 14:39]
- State "DONE"       from "TODO"       [2021-08-12 Thu 14:22]
- State "DONE"       from "STRT"       [2021-08-11 Wed 14:25]
- State "DONE"       from "TODO"       [2021-08-11 Wed 10:01]
- State "DONE"       from "DOING"      [2021-08-09 Mon 14:27]
- State "DONE"       from "DOING"      [2021-08-08 Sun 23:53]
- State "DONE"       from "TODO"       [2021-08-08 Sun 23:37]
- State "DONE"       from "DOING"      [2021-08-06 Fri 14:41]
- State "DONE"       from "TODO"       [2021-08-05 Thu 16:51]
- State "DONE"       from "DOING"      [2021-08-04 Wed 14:13]
- State "DONE"       from "TODO"       [2021-08-03 Tue 22:44]
:LOGBOOK:
CLOCK: [2021-08-26 Thu 14:04]--[2021-08-26 Thu 14:13] =>  0:09
CLOCK: [2021-08-23 Mon 14:01]--[2021-08-23 Mon 14:10] =>  0:09
CLOCK: [2021-08-16 Mon 14:05]--[2021-08-16 Mon 14:15] =>  0:10
CLOCK: [2021-08-11 Wed 14:17]--[2021-08-11 Wed 14:25] =>  0:08
CLOCK: [2021-08-09 Mon 14:16]--[2021-08-09 Mon 14:27] =>  0:11
CLOCK: [2021-08-06 Fri 14:32]--[2021-08-06 Fri 14:41] =>  0:09
CLOCK: [2021-08-04 Wed 14:02]--[2021-08-04 Wed 14:13] =>  0:11
CLOCK: [2021-08-03 Tue 09:58]--[2021-08-03 Tue 09:58] =>  0:00
:END:
[2021-08-03 Tue 09:58]
* TODO Finish 1 Leetcode problem :learning:
SCHEDULED: <2021-09-05 Sun 10:30 +1d>
:PROPERTIES:
:LAST_REPEAT: [2021-09-04 Sat 23:12]
:END:
- State "DONE"       from "TODO"       [2021-09-04 Sat 23:12]
- State "DONE"       from "TODO"       [2021-09-03 Fri 23:10]
- State "DONE"       from "TODO"       [2021-09-02 Thu 19:05]
- State "DONE"       from "TODO"       [2021-09-01 Wed 23:04]
- State "DONE"       from "TODO"       [2021-08-31 Tue 10:26]
- State "DONE"       from "STRT"       [2021-08-30 Mon 11:30]
- State "DONE"       from "TODO"       [2021-08-29 Sun 21:20]
- State "DONE"       from "TODO"       [2021-08-28 Sat 13:03]
- State "DONE"       from "TODO"       [2021-08-28 Sat 09:54]
- State "DONE"       from "TODO"       [2021-08-26 Thu 10:38]
- State "DONE"       from "TODO"       [2021-08-25 Wed 13:12]
- State "DONE"       from "TODO"       [2021-08-24 Tue 11:08]
- State "DONE"       from "TODO"       [2021-08-23 Mon 11:48]
- State "KILL"       from "TODO"       [2021-08-23 Mon 10:51]
- State "DONE"       from "TODO"       [2021-08-21 Sat 12:25]
- State "DONE"       from "TODO"       [2021-08-20 Fri 11:05]
- State "DONE"       from "TODO"       [2021-08-19 Thu 10:48]
- State "DONE"       from "TODO"       [2021-08-18 Wed 12:14]
- State "DONE"       from "TODO"       [2021-08-17 Tue 19:14]
- State "DONE"       from "STRT"       [2021-08-16 Mon 10:50]
- State "DONE"       from "STRT"       [2021-08-15 Sun 13:06]
- State "DONE"       from "STRT"       [2021-08-14 Sat 10:26]
- State "DONE"       from "STRT"       [2021-08-13 Fri 11:59]
- State "DONE"       from "STRT"       [2021-08-12 Thu 11:15]
- State "DONE"       from "STRT"       [2021-08-11 Wed 10:46]
- State "DONE"       from "TODO"       [2021-08-10 Tue 11:02]
- State "DONE"       from "DOING"      [2021-08-09 Mon 10:28]
- State "DONE"       from "DOING"      [2021-08-08 Sun 23:37]
- State "DONE"       from "DOING"      [2021-08-07 Sat 11:10]
- State "DONE"       from "DOING"      [2021-08-06 Fri 12:26]
- State "DONE"       from "TODO"       [2021-08-05 Thu 16:51]
- State "DONE"       from "DOING"      [2021-08-04 Wed 11:13]
- State "DONE"       from "TODO"       [2021-08-03 Tue 12:36]
:LOGBOOK:
CLOCK: [2021-08-22 Sun 22:43]--[2021-08-22 Sun 22:55] =>  0:12
CLOCK: [2021-08-16 Mon 10:04]--[2021-08-16 Mon 10:29] =>  0:25
CLOCK: [2021-08-15 Sun 13:03]--[2021-08-15 Sun 13:06] =>  0:03
CLOCK: [2021-08-14 Sat 10:16]--[2021-08-14 Sat 10:26] =>  0:10
CLOCK: [2021-08-13 Fri 11:48]--[2021-08-13 Fri 11:59] =>  0:11
CLOCK: [2021-08-12 Thu 10:02]--[2021-08-12 Thu 10:27] =>  0:25
CLOCK: [2021-08-11 Wed 10:37]--[2021-08-11 Wed 10:46] =>  0:09
CLOCK: [2021-08-09 Mon 10:21]--[2021-08-09 Mon 10:28] =>  0:07
CLOCK: [2021-08-08 Sun 22:46]--[2021-08-08 Sun 23:11] =>  0:25
CLOCK: [2021-08-07 Sat 10:56]--[2021-08-07 Sat 11:10] =>  0:14
CLOCK: [2021-08-07 Sat 10:09]--[2021-08-07 Sat 10:34] =>  0:25
CLOCK: [2021-08-06 Fri 12:08]--[2021-08-06 Fri 12:26] =>  0:18
CLOCK: [2021-08-04 Wed 11:09]--[2021-08-04 Wed 11:13] =>  0:04
CLOCK: [2021-08-03 Tue 10:14]--[2021-08-03 Tue 10:15] =>  0:01
:END:
[2021-08-03 Tue 10:14]
* TODO [[id:cb6871f7-e947-4c60-a04e-244ccaf8b59b][Java Interview Questions]] :learning:
SCHEDULED: <2021-09-02 Thu 12:00 +1d>
:PROPERTIES:
:LAST_REPEAT: [2021-09-02 Thu 19:05]
:END:
- State "KILL"       from "TODO"       [2021-09-02 Thu 19:05]
- State "KILL"       from "TODO"       [2021-09-02 Thu 19:05]
- State "DONE"       from "STRT"       [2021-08-30 Mon 11:38]
- State "KILL"       from "TODO"       [2021-08-30 Mon 09:52]
- State "KILL"       from "TODO"       [2021-08-29 Sun 20:47]
- State "KILL"       from "TODO"       [2021-08-28 Sat 09:54]
- State "DONE"       from "STRT"       [2021-08-26 Thu 12:06]
- State "DONE"       from "STRT"       [2021-08-25 Wed 13:26]
- State "DONE"       from "STRT"       [2021-08-24 Tue 11:53]
- State "DONE"       from "STRT"       [2021-08-23 Mon 12:15]
- State "KILL"       from "TODO"       [2021-08-23 Mon 10:51]
- State "DONE"       from "STRT"       [2021-08-21 Sat 12:42]
- State "DONE"       from "STRT"       [2021-08-20 Fri 12:15]
- State "DONE"       from "STRT"       [2021-08-19 Thu 11:36]
- State "DONE"       from "TODO"       [2021-08-18 Wed 12:46]
- State "KILL"       from "TODO"       [2021-08-18 Wed 11:05]
- State "DONE"       from "STRT"       [2021-08-16 Mon 11:20]
- State "KILL"       from "TODO"       [2021-08-15 Sun 13:23]
- State "DONE"       from "STRT"       [2021-08-14 Sat 10:47]
- State "DONE"       from "STRT"       [2021-08-13 Fri 12:14]
- State "DONE"       from "STRT"       [2021-08-12 Thu 12:05]
- State "DONE"       from "STRT"       [2021-08-11 Wed 11:13]
- State "DONE"       from "TODO"       [2021-08-10 Tue 11:02]
- State "DONE"       from "DOING"      [2021-08-09 Mon 10:43]
- State "CANCEL"     from "TODO"       [2021-08-09 Mon 10:29]
- State "DONE"       from "DOING"      [2021-08-07 Sat 11:39]
- State "DONE"       from "DOING"      [2021-08-06 Fri 13:01]
- State "CANCEL"     from "TODO"       [2021-08-06 Fri 12:27]
- State "DONE"       from "DOING"      [2021-08-04 Wed 12:10]
- State "DONE"       from "DOING"      [2021-08-03 Tue 11:07]
:LOGBOOK:
CLOCK: [2021-08-30 Mon 11:31]--[2021-08-30 Mon 11:38] =>  0:07
CLOCK: [2021-08-24 Tue 11:13]--[2021-08-24 Tue 11:38] =>  0:25
CLOCK: [2021-08-23 Mon 11:49]--[2021-08-23 Mon 12:14] =>  0:25
CLOCK: [2021-08-21 Sat 12:25]--[2021-08-21 Sat 12:42] =>  0:17
CLOCK: [2021-08-20 Fri 11:26]--[2021-08-20 Fri 11:51] =>  0:25
CLOCK: [2021-08-19 Thu 11:21]--[2021-08-19 Thu 11:36] =>  0:15
CLOCK: [2021-08-18 Wed 12:24]--[2021-08-18 Wed 12:46] =>  0:22
CLOCK: [2021-08-16 Mon 11:03]--[2021-08-16 Mon 11:20] =>  0:17
CLOCK: [2021-08-14 Sat 10:31]--[2021-08-14 Sat 10:46] =>  0:15
CLOCK: [2021-08-13 Fri 12:01]--[2021-08-13 Fri 12:14] =>  0:13
CLOCK: [2021-08-09 Mon 10:29]--[2021-08-09 Mon 10:43] =>  0:14
CLOCK: [2021-08-07 Sat 11:16]--[2021-08-07 Sat 11:39] =>  0:23
CLOCK: [2021-08-06 Fri 12:58]--[2021-08-06 Fri 13:01] =>  0:03
CLOCK: [2021-08-06 Fri 12:27]--[2021-08-06 Fri 12:52] =>  0:25
CLOCK: [2021-08-04 Wed 11:47]--[2021-08-04 Wed 12:10] =>  0:23
CLOCK: [2021-08-03 Tue 10:56]--[2021-08-03 Tue 11:07] =>  0:11
:END:
[2021-08-03 Tue 10:17]
* DONE Change all leetcode notes into org-mode                         :normal:
CLOSED: [2021-08-03 Tue 12:35] SCHEDULED: <2021-08-03 Tue>
:LOGBOOK:
CLOCK: [2021-08-03 Tue 11:59]--[2021-08-03 Tue 12:24] =>  0:25
CLOCK: [2021-08-03 Tue 11:25]--[2021-08-03 Tue 11:25] =>  0:00
CLOCK: [2021-08-03 Tue 11:24]--[2021-08-03 Tue 11:24] =>  0:00
CLOCK: [2021-08-03 Tue 11:23]--[2021-08-03 Tue 11:23] =>  0:00
:END:
[2021-08-03 Tue 11:22]
[[file:~/org/RoamNotes/20210803025017-leetcode.org::+title: Leetcode]]
* DONE Add record number to personal website: fastdata.top
CLOSED: [2021-08-05 Thu 16:50] SCHEDULED: <2021-08-04 Wed 14:30>
:LOGBOOK:
CLOCK: [2021-08-04 Wed 12:18]--[2021-08-04 Wed 12:19] =>  0:01
:END:
[2021-08-04 Wed 12:18]
* TODO Reading Hadoop definition guide
SCHEDULED: <2021-09-02 Thu 12:00 +1d>
:PROPERTIES:
:LAST_REPEAT: [2021-09-02 Thu 19:05]
:END:
- State "KILL"       from "TODO"       [2021-09-02 Thu 19:05]
- State "KILL"       from "TODO"       [2021-09-02 Thu 19:05]
- State "DONE"       from "TODO"       [2021-08-30 Mon 12:06]
- State "KILL"       from "TODO"       [2021-08-30 Mon 09:53]
- State "KILL"       from "TODO"       [2021-08-29 Sun 20:47]
- State "KILL"       from "TODO"       [2021-08-28 Sat 09:55]
- State "DONE"       from "STRT"       [2021-08-26 Thu 12:55]
- State "KILL"       from "TODO"       [2021-08-26 Thu 10:09]
- State "DONE"       from "STRT"       [2021-08-24 Tue 12:38]
- State "DONE"       from "STRT"       [2021-08-23 Mon 12:50]
- State "DONE"       from "TODO"       [2021-08-23 Mon 10:51]
- State "KILL"       from "TODO"       [2021-08-23 Mon 10:51]
- State "DONE"       from "STRT"       [2021-08-20 Fri 12:31]
- State "DONE"       from "STRT"       [2021-08-19 Thu 12:01]
- State "DONE"       from "STRT"       [2021-08-18 Wed 13:23]
- State "KILL"       from "TODO"       [2021-08-18 Wed 11:05]
- State "DONE"       from "STRT"       [2021-08-16 Mon 12:03]
- State "KILL"       from "TODO"       [2021-08-15 Sun 13:23]
- State "KILL"       from "TODO"       [2021-08-15 Sun 13:17]
- State "DONE"       from "STRT"       [2021-08-13 Fri 13:16]
- State "DONE"       from "STRT"       [2021-08-12 Thu 12:28]
- State "DONE"       from "STRT"       [2021-08-11 Wed 11:40]
- State "DONE"       from "TODO"       [2021-08-10 Tue 18:41]
- State "DONE"       from "DOING"      [2021-08-09 Mon 11:07]
- State "CANCEL"     from "TODO"       [2021-08-09 Mon 10:44]
- State "DONE"       from "DOING"      [2021-08-07 Sat 12:01]
- State "DONE"       from "DOING"      [2021-08-06 Fri 13:25]
- State "CANCEL"     from "TODO"       [2021-08-06 Fri 13:02]
- State "DONE"       from "DOING"      [2021-08-04 Wed 14:02]
:LOGBOOK:
CLOCK: [2021-08-26 Thu 12:27]--[2021-08-26 Thu 12:52] =>  0:25
CLOCK: [2021-08-24 Tue 12:12]--[2021-08-24 Tue 12:37] =>  0:25
CLOCK: [2021-08-23 Mon 12:21]--[2021-08-23 Mon 12:46] =>  0:25
CLOCK: [2021-08-19 Thu 11:51]--[2021-08-19 Thu 12:01] =>  0:10
CLOCK: [2021-08-18 Wed 13:20]--[2021-08-18 Wed 13:23] =>  0:03
CLOCK: [2021-08-18 Wed 12:50]--[2021-08-18 Wed 13:15] =>  0:25
CLOCK: [2021-08-16 Mon 11:38]--[2021-08-16 Mon 12:03] =>  0:25
CLOCK: [2021-08-13 Fri 13:10]--[2021-08-13 Fri 13:16] =>  0:06
CLOCK: [2021-08-13 Fri 12:40]--[2021-08-13 Fri 13:05] =>  0:25
CLOCK: [2021-08-12 Thu 12:06]--[2021-08-12 Thu 12:28] =>  0:22
CLOCK: [2021-08-11 Wed 11:14]--[2021-08-11 Wed 11:39] =>  0:25
CLOCK: [2021-08-07 Sat 11:40]--[2021-08-07 Sat 12:01] =>  0:21
CLOCK: [2021-08-06 Fri 13:02]--[2021-08-06 Fri 13:25] =>  0:23
CLOCK: [2021-08-04 Wed 13:00]--[2021-08-04 Wed 13:25] =>  0:25
CLOCK: [2021-08-04 Wed 12:30]--[2021-08-04 Wed 12:55] =>  0:25
CLOCK: [2021-08-04 Wed 12:29]--[2021-08-04 Wed 12:29] =>  0:00
:END:
[2021-08-04 Wed 12:28]
* TODO change this style into functional style (by using reduceLeft or recudeRight or any functions else)
SCHEDULED: <2021-08-09 Mon 22:00>
:LOGBOOK:
CLOCK: [2021-08-09 Mon 18:56]--[2021-08-09 Mon 18:57] =>  0:01
:END:
[2021-08-09 Mon 18:56]
[[file:~/Documents/code/Work/java-data-handlers/src/main/scala/com/labelhub/datahandlers/nuport/ExportTxt.scala::dataArr.forEach(dataItem => {]]
* Inbox
** [ ] 什么是小样本学习平台 #B :learning:
DEADLINE: <2021-08-27 Fri> SCHEDULED: <2021-08-23 Mon>

[[file:~/org/notes.org::*\[2021-08-23 Mon\] \[\[https://tech.meituan.com/2021/08/19/low-resource-learning.html\]\[小样本学习在美团中的应用\]\]][[2021-08-23 Mon] 小样本学习在美团中的应用]]
** DONE Handle the Guowang Image :labelhub:work:
SCHEDULED: <2021-08-20 Fri 11:10>
:LOGBOOK:
CLOCK: [2021-08-20 Fri 11:19]--[2021-08-20 Fri 11:24] =>  0:05
:END:

** TODO Read and learning Leetcode cn data type articles :learning:
SCHEDULED: <2021-09-03 Fri 10:00 +1d>
:PROPERTIES:
:LAST_REPEAT: [2021-09-02 Thu 19:06]
:END:
- State "KILL"       from "TODO"       [2021-09-02 Thu 19:06]
- State "KILL"       from "TODO"       [2021-09-02 Thu 19:05]
- State "DONE"       from "STRT"       [2021-08-31 Tue 11:25]
- State "DONE"       from "STRT"       [2021-08-30 Mon 11:19]
- State "DONE"       from "STRT"       [2021-08-29 Sun 21:12]
- State "DONE"       from "STRT"       [2021-08-28 Sat 13:03]
- State "DONE"       from "STRT"       [2021-08-28 Sat 09:54]
- State "DONE"       from "STRT"       [2021-08-26 Thu 11:09]
- State "DONE"       from "STRT"       [2021-08-25 Wed 13:06]
- State "DONE"       from "STRT"       [2021-08-24 Tue 11:08]
- State "DONE"       from "STRT"       [2021-08-23 Mon 11:47]
- State "KILL"       from "TODO"       [2021-08-23 Mon 10:51]
- State "DONE"       from "STRT"       [2021-08-21 Sat 12:21]
- State "DONE"       from "STRT"       [2021-08-20 Fri 11:03]
- State "DONE"       from "STRT"       [2021-08-19 Thu 11:20]
- State "DONE"       from "STRT"       [2021-08-18 Wed 12:14]
:LOGBOOK:
CLOCK: [2021-08-31 Tue 11:17]--[2021-08-31 Tue 11:25] =>  0:08
CLOCK: [2021-08-31 Tue 10:33]--[2021-08-31 Tue 10:58] =>  0:25
CLOCK: [2021-08-31 Tue 10:03]--[2021-08-31 Tue 10:28] =>  0:25
CLOCK: [2021-08-30 Mon 09:53]--[2021-08-30 Mon 10:18] =>  0:25
CLOCK: [2021-08-28 Sat 10:43]--[2021-08-28 Sat 11:08] =>  0:25
CLOCK: [2021-08-28 Sat 10:13]--[2021-08-28 Sat 10:38] =>  0:25
CLOCK: [2021-08-27 Fri 11:10]--[2021-08-27 Fri 11:35] =>  0:25
CLOCK: [2021-08-27 Fri 10:02]--[2021-08-27 Fri 10:27] =>  0:25
CLOCK: [2021-08-26 Thu 10:48]--[2021-08-26 Thu 11:09] =>  0:21
CLOCK: [2021-08-26 Thu 10:10]--[2021-08-26 Thu 10:35] =>  0:25
CLOCK: [2021-08-25 Wed 10:43]--[2021-08-25 Wed 11:08] =>  0:25
CLOCK: [2021-08-25 Wed 10:13]--[2021-08-25 Wed 10:38] =>  0:25
CLOCK: [2021-08-24 Tue 10:09]--[2021-08-24 Tue 10:34] =>  0:25
CLOCK: [2021-08-23 Mon 11:22]--[2021-08-23 Mon 11:47] =>  0:25
CLOCK: [2021-08-23 Mon 10:52]--[2021-08-23 Mon 11:17] =>  0:25
CLOCK: [2021-08-21 Sat 11:51]--[2021-08-21 Sat 12:16] =>  0:25
CLOCK: [2021-08-21 Sat 11:11]--[2021-08-21 Sat 11:36] =>  0:25
CLOCK: [2021-08-21 Sat 10:36]--[2021-08-21 Sat 11:01] =>  0:25
CLOCK: [2021-08-20 Fri 10:56]--[2021-08-20 Fri 11:03] =>  0:07
CLOCK: [2021-08-20 Fri 10:07]--[2021-08-20 Fri 10:32] =>  0:25
CLOCK: [2021-08-19 Thu 10:46]--[2021-08-19 Thu 11:11] =>  0:25
CLOCK: [2021-08-19 Thu 10:00]--[2021-08-19 Thu 10:25] =>  0:25
CLOCK: [2021-08-18 Wed 11:35]--[2021-08-18 Wed 12:00] =>  0:25
:END:

** DONE make an interview roadmap :interview:
SCHEDULED: <2021-08-18 Wed 11:20>

** DONE fix the qa-info loss content issue :work:labelhub:
SCHEDULED: <2021-08-15 Sun>
** DONE show pid info on project card :work:labelhub:
SCHEDULED: <2021-08-15 Sun>
** DONE differ the label detail :work:
SCHEDULED: <2021-08-12 Thu 15:00>
:LOGBOOK:
CLOCK: [2021-08-16 Mon 16:20]--[2021-08-16 Mon 16:45] =>  0:25
CLOCK: [2021-08-16 Mon 12:50]--[2021-08-16 Mon 13:15] =>  0:25
CLOCK: [2021-08-16 Mon 12:14]--[2021-08-16 Mon 12:39] =>  0:25
CLOCK: [2021-08-12 Thu 18:11]--[2021-08-12 Thu 18:36] =>  0:25
CLOCK: [2021-08-12 Thu 17:41]--[2021-08-12 Thu 18:06] =>  0:25
CLOCK: [2021-08-12 Thu 16:20]--[2021-08-12 Thu 16:45] =>  0:25
:END:

** DONE organize the self-taught undergraduate registration process :normal:
SCHEDULED: <2021-08-12 Thu 13:00>

** TODO Read a technique article and write some notes :learning:
SCHEDULED: <2021-09-02 Thu 14:20 +1d>
:PROPERTIES:
:LAST_REPEAT: [2021-09-02 Thu 19:05]
:END:
- State "KILL"       from "TODO"       [2021-09-02 Thu 19:05]
- State "KILL"       from "TODO"       [2021-09-02 Thu 19:05]
- State "KILL"       from "TODO"       [2021-08-31 Tue 10:03]
- State "KILL"       from "TODO"       [2021-08-30 Mon 09:53]
- State "KILL"       from "TODO"       [2021-08-29 Sun 20:47]
- State "KILL"       from "TODO"       [2021-08-28 Sat 09:55]
- State "KILL"       from "TODO"       [2021-08-27 Fri 10:01]
- State "KILL"       from "TODO"       [2021-08-26 Thu 10:09]
- State "KILL"       from "TODO"       [2021-08-25 Wed 10:13]
- State "DONE"       from "STRT"       [2021-08-23 Mon 14:29]
- State "KILL"       from "TODO"       [2021-08-23 Mon 10:52]
- State "KILL"       from "TODO"       [2021-08-23 Mon 10:51]
- State "KILL"       from "TODO"       [2021-08-21 Sat 09:54]
- State "KILL"       from "TODO"       [2021-08-20 Fri 10:07]
- State "KILL"       from "TODO"       [2021-08-19 Thu 10:00]
- State "KILL"       from "TODO"       [2021-08-18 Wed 11:05]
- State "DONE"       from "STRT"       [2021-08-16 Mon 14:32]
- State "KILL"       from "TODO"       [2021-08-15 Sun 13:23]
- State "KILL"       from "TODO"       [2021-08-15 Sun 13:18]
- State "DONE"       from "STRT"       [2021-08-13 Fri 14:41]
- State "KILL"       from "TODO"       [2021-08-13 Fri 12:16]
- State "DONE"       from "STRT"       [2021-08-11 Wed 15:01]
:LOGBOOK:
CLOCK: [2021-08-23 Mon 14:18]--[2021-08-23 Mon 14:29] =>  0:11
CLOCK: [2021-08-16 Mon 14:26]--[2021-08-16 Mon 14:32] =>  0:06
CLOCK: [2021-08-13 Fri 14:37]--[2021-08-13 Fri 14:41] =>  0:04
CLOCK: [2021-08-11 Wed 14:26]--[2021-08-11 Wed 14:51] =>  0:25
:END:

** DONE write local csv data into HDFS :work:greyparrot:
SCHEDULED: <2021-08-11 Wed 13:00>
:LOGBOOK:
CLOCK: [2021-08-11 Wed 16:28]--[2021-08-11 Wed 16:53] =>  0:25
CLOCK: [2021-08-11 Wed 15:57]--[2021-08-11 Wed 16:22] =>  0:25
CLOCK: [2021-08-11 Wed 15:27]--[2021-08-11 Wed 15:52] =>  0:25
CLOCK: [2021-08-11 Wed 15:01]--[2021-08-11 Wed 15:26] =>  0:25
CLOCK: [2021-08-11 Wed 13:30]--[2021-08-11 Wed 13:55] =>  0:25
CLOCK: [2021-08-11 Wed 12:59]--[2021-08-11 Wed 13:24] =>  0:25
:END:

** DONE learning how to read papers by using zotero :learning:
SCHEDULED: <2021-08-11 Wed 12:00>
:LOGBOOK:
CLOCK: [2021-08-11 Wed 12:05]--[2021-08-11 Wed 12:30] =>  0:25
:END:

** DONE export nuport origin images :work:nuport:
SCHEDULED: <2021-08-11 Wed 13:00>
:LOGBOOK:
CLOCK: [2021-08-11 Wed 10:09]--[2021-08-11 Wed 10:34] =>  0:25
:END:


** [X] know about DOOM emacs
SCHEDULED: <2021-08-10 Tue 22:00>
